app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)
    if @project.save
---
INSERT INTO "projects" ("title", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Second_project"], ["created_by", "Owner_2"], ["created_at", "2020-03-03 21:04:26.453770"], ["updated_at", "2020-03-03 21:04:26.453770"]]

  def update
    @project = Project.find(params[:id])
    @project.update(project_params)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "projects" SET "title" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["title", "project_NOT_first"], ["updated_at", "2020-03-03 20:36:11.734500"], ["id", 1]]

  def destroy
    @projects = Project.all
    @project = @projects.find(params[:id])
    @project.destroy
---
SELECT "projects".* FROM "projects" WHERE (1) LIMIT ?  [["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]