app/controllers/tasks_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 1]]
---
  def index
    @project = Project.find(params[:project_id])
    @task = @project.tasks.all

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tasks" ("name_task", "priority", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name_task", "some_task"], ["priority", 100], ["project_id", 1], ["created_at", "2020-03-10 16:22:54.177583"], ["updated_at", "2020-03-10 16:22:54.177583"]]
---
  def create
    @project = Project.find(params[:project_id])
    @task = @project.tasks.new(task_params)
    if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "priority" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["priority", 100], ["updated_at", "2020-03-04 19:30:01.995477"], ["id", 1]]
---
  def update
    @task = Task.find(params[:id])
    @task.update(task_params)